<a href="https://colab.research.google.com/github/ProfessorPatrickSlatraigh/CST3512/blob/main/CST3512_Intro_SQL_sub_queries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Introduction to SQL Sub-Queries

This notebook explore the basics of the use of sub-queries with SQL

###Housekeeping    

Import libraries

In [7]:
import sqlite3

### Step 1 - Create a database file

In [8]:
conn = sqlite3.connect('test.db')
print("Opened database successfully");

Opened database successfully

### Step 2 - Create a table in the database file

In [9]:
# CREATING THE TABLE

conn.execute('''
CREATE TABLE IF NOT EXISTS team_data(team text, 
                      country text, 
                      season integer, 
                      total_goals integer);''')

conn.commit()

print("Table created successfully");

# conn.close() # Do not forget to close the db eventually

Table created successfully

### Step 3 - Insert records of data into the table

In [2]:
# INSERTING VALUES

conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2019, 53);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2019, 47);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2019, 52);")
conn.execute("INSERT INTO team_data VALUES('Real Madrid', 'Spain', 2018, 49);")
conn.execute("INSERT INTO team_data VALUES('Barcelona', 'Spain', 2018, 45);")
conn.execute("INSERT INTO team_data VALUES('Arsenal', 'UK', 2018, 50 );")

conn.commit()

### Step 4 - Close the database file

In [3]:
conn.close()

## Now, try using the data in the fields, in the table, in the database file

In [ ]:
# Average goal by team

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

In [ ]:
# First try to filter the teams with average goals higher than 50
# This query will generate an error

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                          FROM team_data
                          WHERE avg_goals > 50
                          GROUP BY team;''')

for row in cursor:
  print(row)
conn.close()

In [ ]:
# Now, the correct query, using the appropriate sub-query

conn = sqlite3.connect('test.db')

cursor = conn.execute(''' SELECT team_name, avg_goals
                          FROM (

                          -- Here we make our sub-query:
                            SELECT team AS team_name,
                            AVG(total_goals) AS avg_goals
                            FROM team_data
                            GROUP BY team) tp
                          -- End of the sub-query
                          
                          WHERE avg_goals > 50;''')

for row in cursor:
  print(row)
conn.close()

In [6]:
conn.close() # Do not forget to close the db eventually

That's it, this code should be used as a complement to the article